## Messy HR Data Cleaning

#### Step:1 Importing Libraries

In [72]:
import pandas as pd
import numpy as np
from dateutil import parser
import matplotlib.pyplot as plt
!pip install word2number

Requirement already satisfied: word2number in d:\anaconda\lib\site-packages (1.1)

#### Step 2: Analyze the Data

In [78]:
data = pd.read_csv('messy_HR_data.csv')
data.head()

,Name,Age,Salary,Gender,Department,Position,Joining Date,Performance Score,Email,Phone Number
0,grace,25,50000,Male,HR,Manager,"April 5, 2018",D,email@example.com,NaN
1,david,NaN,65000,Female,Finance,Director,2020/02/20,F,user@domain.com,123-456-7890
2,hannah,35,SIXTY THOUSAND,Female,Sales,Director,01/15/2020,C,email@example.com,098-765-4321
3,eve,NaN,50000,Female,IT,Manager,"April 5, 2018",A,name@company.org,
4,grace,NaN,NAN,Female,Finance,Manager,01/15/2020,F,name@company.org,098-765-4321

In [79]:
data.tail()

,Name,Age,Salary,Gender,Department,Position,Joining Date,Performance Score,Email,Phone Number
995,jack,50,65000,Female,HR,Manager,2020/02/20,F,NaN,098-765-4321
996,jack,thirty,50000,Male,Finance,Analyst,"April 5, 2018",C,NaN,555-555-5555
997,hannah,thirty,70000,Male,IT,Assistant,01/15/2020,D,user@domain.com,NaN
998,bob,25,65000,Other,Marketing,Manager,"April 5, 2018",D,email@example.com,NaN
999,ivy,thirty,SIXTY THOUSAND,Male,Finance,Manager,2020/02/20,C,user@domain.com,123-456-7890

In [80]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               1000 non-null   object
 1   Age                841 non-null    object
 2   Salary             1000 non-null   object
 3   Gender             1000 non-null   object
 4   Department         1000 non-null   object
 5   Position           1000 non-null   object
 6   Joining Date       1000 non-null   object
 7   Performance Score  1000 non-null   object
 8   Email              610 non-null    object
 9   Phone Number       815 non-null    object
dtypes: object(10)
memory usage: 78.3+ KB

In [81]:
data.describe().round()

,Name,Age,Salary,Gender,Department,Position,Joining Date,Performance Score,Email,Phone Number
count,1000,841,1000,1000,1000,1000,1000,1000,610,815
unique,10,5,6,3,5,5,5,5,3,4
top,alice,thirty,65000,Male,Finance,Assistant,2020/02/20,B,user@domain.com,123-456-7890
freq,118,176,184,355,218,214,232,225,213,236

#### how much % of Null data are there in each Col

In [82]:
data.isnull().sum()/len(data)*100

Name                  0.0
Age                  15.9
Salary                0.0
Gender                0.0
Department            0.0
Position              0.0
Joining Date          0.0
Performance Score     0.0
Email                39.0
Phone Number         18.5
dtype: float64

In [83]:
data.shape[0]

1000

In [84]:
data.shape[1]

10

In [85]:
data.shape

(1000, 10)

In [86]:
data[data.duplicated()].shape

(0, 10)

#### Identifying Duplicates

In [87]:
data[data.duplicated()]

Empty DataFrame
Columns: [Name, Age, Salary, Gender, Department, Position, Joining Date, Performance Score, Email, Phone Number]
Index: []

In [88]:
data['Phone Number'].value_counts()

Phone Number
123-456-7890    236
098-765-4321    199
                191
555-555-5555    189
Name: count, dtype: int64

#### Show how much data are repeated

In [117]:
for col in data.columns:
    if data[col].nunique()  :
        print(data[col].value_counts())
        print('-'*50)

Name
alice       118
charlie     110
eve         107
jack        107
hannah      100
frank        96
grace        94
david        94
ivy          91
bob          83
Name: count, dtype: int64
--------------------------------------------------
Age
30    176
25    171
40    170
35    163
50    161
Name: count, dtype: Int64
--------------------------------------------------
Salary
65000    184
70000    173
55000    172
50000    161
60000    143
Name: count, dtype: Int64
--------------------------------------------------
Gender
Male      355
Other     332
Female    313
Name: count, dtype: int64
--------------------------------------------------
Department
Finance      218
Sales        202
HR           200
IT           193
Marketing    187
Name: count, dtype: int64
--------------------------------------------------
Position
Assistant    214
Director     204
Clerk        202
Analyst      194
Manager      186
Name: count, dtype: int64
--------------------------------------------------
Joining Date
2020-02-20    232
2019-12-01    205
2020-01-15    197
2018-04-05    186
2019-03-25    180
Name: count, dtype: int64
--------------------------------------------------
Performance Score
B    225
F    201
A    192
C    192
E      0
Name: count, dtype: int64
--------------------------------------------------
Email
user@domain.com      213
email@example.com    208
name@company.org     189
Name: count, dtype: int64
--------------------------------------------------
Phone Number
1234567890    236
0987654321    199
              191
5555555555    189
Name: count, dtype: int64
--------------------------------------------------

#### word2number library for AGE & Salary

In [90]:
from word2number import w2n
def convert_to_int(x):
    try:
        return int(x)  # if it's already a numeric string
    except ValueError:
        try:
            return w2n.word_to_num(x)  # if it's written in words
        except:
            return None  # fallback if conversion fails
data['Age'] = data['Age'].apply(convert_to_int)
data.tail()

#ORR
# data['Age'] = data['age'].replace({'thirty': 30}) best for this data cz here only 'thirty' is there in it

,Name,Age,Salary,Gender,Department,Position,Joining Date,Performance Score,Email,Phone Number
995,jack,50.0,65000,Female,HR,Manager,2020/02/20,F,NaN,098-765-4321
996,jack,30.0,50000,Male,Finance,Analyst,"April 5, 2018",C,NaN,555-555-5555
997,hannah,30.0,70000,Male,IT,Assistant,01/15/2020,D,user@domain.com,NaN
998,bob,25.0,65000,Other,Marketing,Manager,"April 5, 2018",D,email@example.com,NaN
999,ivy,30.0,SIXTY THOUSAND,Male,Finance,Manager,2020/02/20,C,user@domain.com,123-456-7890

In [91]:
data['Salary'] = data['Salary'].apply(convert_to_int)
data.tail()
#ORR
# data['Salary'] = data['Salary'].replace({'SIXTY THOUSAND': 60000}) suitable for this data

,Name,Age,Salary,Gender,Department,Position,Joining Date,Performance Score,Email,Phone Number
995,jack,50.0,65000.0,Female,HR,Manager,2020/02/20,F,NaN,098-765-4321
996,jack,30.0,50000.0,Male,Finance,Analyst,"April 5, 2018",C,NaN,555-555-5555
997,hannah,30.0,70000.0,Male,IT,Assistant,01/15/2020,D,user@domain.com,NaN
998,bob,25.0,65000.0,Other,Marketing,Manager,"April 5, 2018",D,email@example.com,NaN
999,ivy,30.0,60000.0,Male,Finance,Manager,2020/02/20,C,user@domain.com,123-456-7890

#### Changing Datatype of AGE & Salary to INT64

In [92]:
data['Age'] = data['Age'].astype('Int64')
data["Salary"] = data['Salary'].astype('Int64')
print(data.dtypes)

Name                 object
Age                   Int64
Salary                Int64
Gender               object
Department           object
Position             object
Joining Date         object
Performance Score    object
Email                object
Phone Number         object
dtype: object

#### Changing Format od Phone Number

In [93]:
data['Phone Number'] = data['Phone Number'].str.replace('-' , '')
data['Phone Number']

0             NaN
1      1234567890
2      0987654321
3
4      0987654321
          ...
995    0987654321
996    5555555555
997           NaN
998           NaN
999    1234567890
Name: Phone Number, Length: 1000, dtype: object

#### We dont need any mathematical operation on Phone NO. so object is fine

In [94]:
data.head()

,Name,Age,Salary,Gender,Department,Position,Joining Date,Performance Score,Email,Phone Number
0,grace,25,50000,Male,HR,Manager,"April 5, 2018",D,email@example.com,NaN
1,david,<NA>,65000,Female,Finance,Director,2020/02/20,F,user@domain.com,1234567890
2,hannah,35,60000,Female,Sales,Director,01/15/2020,C,email@example.com,0987654321
3,eve,<NA>,50000,Female,IT,Manager,"April 5, 2018",A,name@company.org,
4,grace,<NA>,<NA>,Female,Finance,Manager,01/15/2020,F,name@company.org,0987654321

In [95]:
data['Joining Date'] = data['Joining Date'].apply(
    lambda x: parser.parse(x) if isinstance(x, str) else x
)
data.head()
data.dtypes

Name                         object
Age                           Int64
Salary                        Int64
Gender                       object
Department                   object
Position                     object
Joining Date         datetime64[ns]
Performance Score            object
Email                        object
Phone Number                 object
dtype: object

#### Changing Performance Score data type to Categorical Data

In [97]:
data['Performance Score'] = data['Performance Score'].astype('category')
# say A is best, F is worst:
data['Performance Score'] = pd.Categorical(
    data['Performance Score'],
    categories=['A', 'B', 'C','E','F'],
    ordered=True
)
data.dtypes

Name                         object
Age                           Int64
Salary                        Int64
Gender                       object
Department                   object
Position                     object
Joining Date         datetime64[ns]
Performance Score          category
Email                        object
Phone Number                 object
dtype: object

#### Now you can Filter Data in order A > B > C > D and F is fail / poor

In [110]:
# Using bitwise OR
data[(data['Performance Score'] == "A") | (data['Performance Score'] == "B")]

,Name,Age,Salary,Gender,Department,Position,Joining Date,Performance Score,Email,Phone Number
1,david,<NA>,65000,Female,Finance,Director,2020-02-20,F,user@domain.com,1234567890
2,hannah,35,60000,Female,Sales,Director,2020-01-15,C,email@example.com,0987654321
4,grace,<NA>,<NA>,Female,Finance,Manager,2020-01-15,F,name@company.org,0987654321
5,jack,<NA>,65000,Other,Marketing,Director,2019-03-25,F,user@domain.com,NaN
7,grace,40,50000,Other,HR,Director,2019-03-25,C,NaN,
...,...,...,...,...,...,...,...,...,...,...
990,hannah,30,60000,Male,HR,Assistant,2019-03-25,C,email@example.com,
991,frank,25,55000,Other,Marketing,Manager,2019-03-25,C,NaN,NaN
995,jack,50,65000,Female,HR,Manager,2020-02-20,F,NaN,0987654321
996,jack,30,50000,Male,Finance,Analyst,2018-04-05,C,NaN,5555555555
999,ivy,30,60000,Male,Finance,Manager,2020-02-20,C,user@domain.com,1234567890

In [111]:
data[data['Performance Score'].isin(["C", "F"])]

,Name,Age,Salary,Gender,Department,Position,Joining Date,Performance Score,Email,Phone Number
1,david,<NA>,65000,Female,Finance,Director,2020-02-20,F,user@domain.com,1234567890
2,hannah,35,60000,Female,Sales,Director,2020-01-15,C,email@example.com,0987654321
4,grace,<NA>,<NA>,Female,Finance,Manager,2020-01-15,F,name@company.org,0987654321
5,jack,<NA>,65000,Other,Marketing,Director,2019-03-25,F,user@domain.com,NaN
7,grace,40,50000,Other,HR,Director,2019-03-25,C,NaN,
...,...,...,...,...,...,...,...,...,...,...
990,hannah,30,60000,Male,HR,Assistant,2019-03-25,C,email@example.com,
991,frank,25,55000,Other,Marketing,Manager,2019-03-25,C,NaN,NaN
995,jack,50,65000,Female,HR,Manager,2020-02-20,F,NaN,0987654321
996,jack,30,50000,Male,Finance,Analyst,2018-04-05,C,NaN,5555555555
999,ivy,30,60000,Male,Finance,Manager,2020-02-20,C,user@domain.com,1234567890